In [1]:
import pandas as pd

In [2]:
#groupby
#concate
#append


df=pd.read_csv(r'C:\Users\saura\Downloads\titanic_data.csv')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [4]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [7]:
df['Pclass'].unique()

array([3, 2, 1], dtype=int64)

In [8]:
df['Embarked'].unique()

array(['Q', 'S', 'C'], dtype=object)

In [9]:
#groupby----
df.groupby(['Pclass'])['Sex'].sum()

Pclass
1    malefemalefemalemalefemalemalefemalefemalemale...
2    malemalemalefemalemalemalemalefemalemalefemale...
3    malefemalemalefemalemalefemalefemalemalemalema...
Name: Sex, dtype: object

In [11]:
df.groupby(['Pclass'])['Survived'].sum()

Pclass
1    50
2    30
3    72
Name: Survived, dtype: int64

In [12]:
#task 1---- try to determine that total number of person who survivd
#task 2---- try to determine the total number of person who are not to able survived
#task 3-----try to get the percentage  of survived and unsurvived passenger in titanic database

survived_passenger=df['Survived'].sum()

In [13]:
survived_passenger

152

In [16]:
total_paggenger=df.shape[0]

In [17]:
total_paggenger

418

In [18]:
unsurvived_passenger=total_paggenger-survived_passenger

In [23]:
unsurvived_passenger

266

In [20]:
per_survived_passenger=(survived_passenger/total_paggenger)*100

In [21]:
per_survived_passenger

36.36363636363637

In [22]:
per_unsurvived_passenger=(unsurvived_passenger/total_paggenger)*100

In [24]:
per_unsurvived_passenger

63.63636363636363

In [26]:
df.groupby(['Pclass'])[['Survived','Fare']].sum()

        Survived        Fare
Pclass
1             50  10087.9918
2             30   2064.7957
3             72   2703.7501

In [27]:
df.Fare.sum()-df.groupby(['Pclass'])['Fare'].sum()

Pclass
1     4768.5458
2    12791.7419
3    12152.7875
Name: Fare, dtype: float64

In [30]:
#unsurvived----
df.loc[df['Survived']<1]['Fare'].sum()

7294.8874000000005